# CreateEnhancedPullDownMenu

## Description
Creates a Layout Manager enhanced pull down menu control.

```pascal
PROCEDURE CreateEnhancedPullDownMenu(
				dialogID              : LONGINT;
				componentID           : LONGINT;
				iWidthInCharacters    : INTEGER;
				bShowIconInMainWindow : BOOLEAN);
```

```python
def vs.CreateEnhancedPullDownMenu(dialogID, componentID, iWidthInCharacters, bShowIconInMainWindow):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |
|iWidthInCharacters|INTEGER|   |
|bShowIconInMainWindow|BOOLEAN|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern